<template>
  <p class="essay">
    <span class="highlightedText">Мое маленькое эссе:</span> <br />
    Все началось с школьной математики - я любил решать задачки, в этом был
    соревновательный интерес, решить ее быстрее остальных, качественнее. <br />
    Есть некоторый <span class="highlightedText">азарт</span> и в самой задаче,
    поскольку на пути к решению испытываешь свой мозг, так со временем, подходя
    к выбору чем хочу заниматься по жизни, я увидел отличную возможность
    совместить финансовый достаток, уже существовавший на тот момент азарт и
    интерес к решению разных логических задач.
    <br />
    Утвердился в этом, когда попал в
    <span class="highlightedText">Devexperts</span>, во многом благодаря
    функциональному программированию как парадигмы, поскольку в рамках
    технологий и сферы совместилось несколько вещей, что мне были и есть
    интересны - математика, экономика и логика, в сумме которые создали для меня
    огромную для исследования область и затянули в программирование. Как-то так
    постепенно я понял, что
    <span class="highlightedText"
      >программирование - моя любовь с первого взгляда.</span
    >
  </p>
</template>

<script>
import "./theme/BiographyEssay.css";

export default {
  name: "BiographyEssay",
};
</script>
